app/controllers/posts_controller.rb

  def index
    @posts = Post.order("id desc").page(params[:page]).per(5)
---
SELECT "posts".* FROM "posts" ORDER BY id desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(params[:post])
    @post.author_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("author_id", "body", "created_at", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "body" = 'Check out this hotness: